Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/responses_to_mortgage_arrears_and_personal_debt.html.txt.tmx
Source language: en
Languages: ga

source: Responses to mortgage arrears and personal debt
ga: Freagairtí maidir le riaráistí morgáiste agus fiachas pearsanta

source: Several initiatives are under way to address the interlinked problems of mortgage arrears and other personal debt
ga: Tá roinnt tionscnaimh éagsúla ar siúl chun dul i ngleic leis na fadhbanna idirnasctha a bhaineann le riaráistí morgáiste agus fiachas pearsanta eile

source: Many are contained in the Mortgage Arrears Plan, described below
ga: Tá formhór na dtionscnamh sin san áireamh sa Phlean um Riaráistí Morgáiste, a leagtar amach thíos

source: The role of the Money Advice and Budgeting Service (MABS) has been enhanced, to include a Dedicated Mortgage Arrears service in several MABS locations and a Court Mentor service to assist debtors faced with court proceedings
ga: Mar chuid den ról nua seo, ta seirbhís tiomnaithe i leith riaráistí morgáiste ar fáil i roinnt láthair de chuid MABS agus tá seirbhís meantóireachta ar fáil chun cabhrú le daoine a bhfuil orthu dul chuig an chúirt

source: These services were launched in December 2015
ga: Seoladh na seirbhísí seo i mí na Nollag 2015

source: MABS is also centrally involved in a new aid and advice scheme for people in serious mortgage arrears as part of Abhaile, the national Mortgage Arrears Resolution Service
ga: Tá ról lárnach ag MABS, freisin, i scéim nua do dhaoine i ndroch-riaráistí morgáiste mar chuid den tseirbhís náisiúnta réitigh do riaráistí morgáiste (Abhaile)

source: The Action Plan for Housing and Homelessness, published in July 2016, proposes:
ga: Beartaítear an méid seo leanas sa Phlean Gníomhaíochta um Thithíocht agus Easpa Dídine, a foilsíodh i mí Iúil 2016:

source: • A national Mortgage Arrears Resolution Service (Abhaile, launched on 3 October 2016)
ga: • Seirbhís náisiúnta réitigh do riaráistí morgáiste (Abhaile, a seoladh ar 3 Deireadh Fómhair 2016)

source: • A national information campaign, targeted at people in long-term mortgage arrears
ga: • Feachtas náisiúnta faisnéise, dírithe ar dhaoine atá i riaráistí morgáiste go fadtéarmach

source: • Possible new legislation, including simplifying the personal insolvency system
ga: • Machnamh ar reachtaíocht nua chun an córas dócmhainneachta pearsanta a shimpliú agus dul i gceann cheisteanna eile

source: • Examining the mortgage-to-rent scheme to identify possible improvements
ga: • Scrúdú a dhéanamh ar an scéim cíos in ionad morgáiste chun leasaithe fédeartha a aimsiú

source: A series of reports dating back to 2010 provides the background to these and other initiatives – see 'Further information' below
ga: Tugtar faisnéis chúlra maidir leis na tionscnaimh uile i sraith tuarascálacha a théann siar go 2010 – féach 'Tuilleadh eolais' thíos

source: In December 2016, the Department of Finance published a detailed Report on Mortgage Arrears, prepared for it by the Central Bank of Ireland
ga: I mí na Nollag 2016, d'fhoilsigh an Roinn Airgeadais miontuarascáil ar riaráistí morgáiste, a d'ullmhaigh Banc Ceannais na hÉireann

source: The Mortgage Arrears Plan was announced in March 2013
ga: Fógraíodh an Plean um Riaráistí Morgáiste i mí Mhárta 2013

source: Its main points are summarised as follows:
ga: Déantar achoimre ar phríomhphointí an Phlean thíos:

source: • Performance targets for banks: The Central Bank required the 6 main banks to propose sustainable solutions for a percentage of arrears accounts (pdf) by specified dates
ga: • Spriocanna feidhmíochta do bhainc: Cheangail an Banc Ceannais ar na 6 phríomhbhainc chun réitigh inbhuanaithe a bheartú do chéatadán cuntais riaráistí (pdf) faoi dhátaí sonraithe

source: It continued to set these rolling Mortgage Arrears Resolution Targets, requiring the banks to meet them on a quarterly basis
ga: Lean an plean leis na Spriocanna Réitigh Riaráistí Morgáiste a leagan amach, agus a cheangal ar na bainc chun iad a bhaint amach ar bhonn ráithiúil

source: In April 2015, following an assessment of its supervisory engagement, it issued revised requirements to the banks
ga: In Aibreán 2015, i ndiaidh go ndearnadh measúnú ar a ghníomhú maoirseachta, d’eisigh sé ceanglais leasaithe do na bainc

source: • Review of Code of Conduct on Mortgage Arrears: A revised Code of Conduct on Mortgage Arrears came into effect in July 2013 - see below
ga: • Athbhreithniú ar an gCód Iompair ar Riaráistí Morgáiste: Tháinig Cód leasaithe Iompair ar Riaráistí Morgáiste i bhfeidhm i mí Iúil 2013 – féach thíos

source: • Insolvency Service of Ireland: The Insolvency Service of Ireland (ISI) was established by the Personal Insolvency Act 2012 and plays a key role in the operation of personal insolvency solutions – see below
ga: • Seirbhís Dócmhainneachta na hÉireann: Bhunaigh an tAcht um Dhócmhainneacht Phearsanta, 2012 Seirbhís Dócmhainneachta na hÉireann (ISI), agus glacann siad príomhfheidhm in oibriú réitigh phearsanta dhócmhainneachta – féach thíos

source: • Mortgage-to-rent and mortgage-to-lease arrangements: There is a national mortgage-to-rent scheme for private mortgages and a mortgage-to-rent scheme for local authorities
ga: • Socruithe cíos in ionad morgáiste agus léas in ionad morgáiste: Tá scéim náisiúnta cíos in ionad morgáiste á hoibriú i gcás morgáistí príobháideacha, mar aon le scéim cíos in ionad morgáiste d’údaráis áitiúla

source: The measures announced in May 2015 include an expansion of the national mortgage-to-rent scheme
ga: I measc na mbeart a fógraíodh i mBealtaine 2015, tá fairsingiú na scéime náisiúnta cíos in ionad morgáiste

source: • Advice and guidance: The Mortgage Arrears Information and Advice Service is described below
ga: • Comhairle agus treoir: Déantar cur síos ar an tSeirbhís um Fhaisnéis agus Comhairle faoi Riaráistí Morgáiste thíos

source: In September 2015, details were announced of a greater role for MABS in offering information, advice and assistance to borrowers in arrears
ga: I mí Mheán Fómhair 2015, fógraíodh sonraí i leith ról níos mó do MABS chun faisnéis, comhairle agus cúnamh a chur ar fáil d’iasachtaithe a bhfuil riaráistí acu

source: • Legislation on repossessions: The Land and Conveyancing Law Reform Act 2013, which became law in July 2013, enabled repossessions to be started again
ga: • Reachtaíocht i leith athshealbhuithe: Tosaíodh ar athshealbhuithe a dhéanamh arís leis an Acht um Athchóiriú an Dlí Talún agus Tíolactha 2013, a tháinig isteach sa dlí i mí Iúil 2013

source: • Monitoring and review: The Central Bank is monitoring banks closely (pdf) to ensure that they make progress on dealing with distressed mortgages as set out in the performance targets outlined above
ga: • Faireachán agus athbhreithniú: Tá an Banc Ceannais ag déanamh dlúthfhaireachán (pdf) ar na bainc chun a chinntiú go ndéanfaidh siad dul chun cinn ar a bheith ag déileáil le morgáistí anásta, faoi mar a leagtar amach sna spriocanna feidhmíochta thuas

source: Code of Conduct on Mortgage Arrears (CCMA)
ga: An Cód Iompair ar Riaráistí Morgáiste (CIRM)

source: The Central Bank’s statutory Code of Conduct on Mortgage Arrears (pdf) sets out the framework that lenders must use when dealing with borrowers who are in mortgage arrears or at risk of falling into arrears
ga: Leagtar amach sa Chód Iompair reachtúil ar Riaráistí Morgáiste (pdf) ón mBanc Ceannais an creat nach mór d’iasachtóirí a úsáid agus iad ag déileáil le hiasachtaithe a bhfuil riaráistí morgáiste acu nó atá i mbaol riaráistí – ‘réamhriaráistí’

source: The original version of the CCMA came into effect in February 2010
ga: Tháinig an bunleagan den CIRM i bhfeidhm i mí Feabhra 2010

source: A substantially revised version was introduced in January 2011, following the report of the Expert Group on Mortgage Arrears and Personal Debt – see 'Further information' below
ga: Rinneadh athrú suntasach ar an mbunleagan sin agus tugadh an leagan nua isteach i mí Eanáir 2011, tar éis fhoilsiú thuarascáil an Ghrúpa Saineolaithe maidir le Riaráistí Morgáiste agus Fiachas Pearsanta – féach 'Tuilleadh eolais' thíos

source: After a further review, a revised CCMA came into effect in July 2013
ga: Tar éis athbhreithniú eile, tháinig Cód athbhreithnithe i bhfeidhm i mí Iúil 2013

source: In June 2015, the Central Bank reported on a themed inspection of compliance with the CCMA
ga: I Meitheamh 2015, rinne an Banc Ceannais tuairisciú ar chigireacht théamach chomhlíonta an PRRM

source: Read more in our document on Consumer protection codes and mortgages
ga: Léigh tuilleadh inár gcáipéis maidir le Cóid chosanta tomhaltóirí agus morgáistí

source: The Personal Insolvency Act 2012 introduced the following 3 debt resolution processes, subject to conditions in each case:
ga: Tugadh isteach leis an Acht um Dhócmhainneacht Phearsanta 2012 próisis nua um réiteach fiachais, atá faoi réir coinníollacha i ngach cás:

source: • A Debt Relief Notice to allow for the write-off of qualifying debt up to €20,000 (later increased to €35,000) subject to a 3-year supervision period
ga: • Fógra um Fhaoiseamh Fiachais chun díscríobh fiachais cháilithigh a mhéid le €20,000 (méadaithe go €35,000) a cheadú, faoi réir tréimhse mhaoirseachta 3 bliana

source: • A Debt Settlement Arrangement for the agreed settlement of unsecured debt over 5 years
ga: • Socrú Réitigh Fiachais le haghaidh réiteach comhaontaithe fiachais neamhurraithe thar 5 bliana

source: • A Personal Insolvency Arrangement for the agreed settlement of secured debt up to €3 million (though this cap can be increased with the consent of all secured creditors) and unsecured debt over 6 years
ga: • Socrú um Dhócmhainneacht Phearsanta le haghaidh réiteach comhaontaithe fiachais faoi urrús a mhéid le €3 milliún (ach is féidir an chaidhp seo a mhéadú le toiliú gach creidiúnaí faoi urrús) agus fiachais gan urrús thar 6 bliana

source: The Personal Insolvency (Amendment) Act 2015 provided for court review of proposed Personal Insolvency Arrangements; increased the threshold for Debt Relief Notices from €20,000 to €35,000; and strengthened the regulatory powers of the Insolvency Service of Ireland (ISI)
ga: Rinne an tAcht um Dhócmhainneacht Phearsanta (Leasú) 2015 foráil d’athbhreithniú cúirte a dhéanamh ar Shocruithe um Dhócmhainneacht Phearsanta atá beartaithe; an tairseach d’Fhógraí um Fhaoiseamh Fiachais a mhéadú aníos ó €20,000 go dtí €35,000; agus cumhachtaí rialála Sheirbhís Dócmhainneachta na hÉireann (ISI) a threisiú

source: The Personal Insolvency Act 2012 revised the rules on bankruptcy
ga: Athbhreithníodh leis an Acht um Dhócmhainneacht Phearsanta 2012 na rialacha maidir le féimheacht

source: Several changes to the bankruptcy laws came into effect in December 2013
ga: Tháinig roinnt athruithe ar an dlí féimheachta i bhfeidhm i mí na Nollag 2013

source: The Bankruptcy (Amendment) Act 2015 made further changes
ga: Rinne an tAcht um Fhéimheacht (Leasú) 2015 roinnt athruithe eile

source: Read more in our document on bankruptcy
ga: Léigh tuilleadh inár gcáipéis maidir le féimheacht

source: Mortgage Arrears Information and Advice Service
ga: An tSeirbhís Faisnéise agus Comhairle ar Riaráistí Morgáiste

source: The Mortgage Arrears Information and Advice Service was launched in September 2012 to assist people with mortgage difficulties
ga: Seoladh an tSeirbhís um Fhaisnéis agus Comhairle faoi Riaráistí Morgáiste i Meán Fómhair 2012 chun cabhrú le daoine ag a bhfuil deacrachtaí morgáiste

source: • A Mortgage Arrears Information Helpline - now operated by MABS (0761 07 2000)
ga: • Líne Chabhrach um Fhaisnéis ar Riaráistí Morgáiste, atá anois á riaradh ag Líne Chabhrach MABS (0761 07 2000)

source: • Availability of financial advice for people being offered long-term restructuring proposals by the banks - see below
ga: • Comhairle airgeadais - féach thíos

source: Financial advice: If you are at an advanced stage in the Mortgage Arrears Resolution Process (MARP), you can consult a practising accountant for advice on the implications of forbearance options proposed by your lender
ga: Comhairle airgeadais: Má tá tú ag ardchéim sa phróiseas PRRM, féadfaidh tú anois dul i gcomhairle le cuntasóir cleachtach chun comhairle a fháil ar impleachtaí roghanna staonta a bheartaíonn d’iasachtóir

source: Your lender will pay for this consultation
ga: Íocfaidh d’iasachtóir as an gcomhairliúchán seo

source: You can select an accountant from a panel drawn from members of recognised accountancy bodies, including the Institute of Chartered Accountants Ireland, the Association of Certified Chartered Accountants, the Institute of Certified Public Accountants and the Institute of Incorporated Public Accountants
ga: Féadfaidh tú cuntasóir a roghnú ó phainéal a cuireadh i dtoll a chéile ó chomhaltaí de chomhlachtaí aitheanta cuntasaíochta, lena n-áirítear Institiúid na gCuntasóirí Cairte in Éirinn, Cumann na gCuntasóirí Cairte Deimhnithe, Institiúid na gCuntasóirí Deimhnithe Poiblí agus Institiúid na gCuntasóirí Poiblí Corpraithe

source: You can find out more about this in the protocol document (pdf) on the keepingyourhome.ie website, where you can also find a list of participating accountants
ga: Féadfaidh tú teacht ar níos mó faisnéise air seo sa cháipéis phrótacail (pdf) ar an láithreán gréasáin keepingyourhome.ie, áit a dtiocfaidh tú ar liosta de chuntasóirí rannpháirteacha chomh maith

source: (A separate panel of accountants is being established under the new Mortgage Arrears Resolution Service, to provide free financial advice under the Scheme of Aid and Advice for borrowers in home mortgage arrears.)
ga: (Tá painéal eile cuntasóirí á chur ar bun faoin tSeirbhís Réitigh Riaráistí Morgáiste, chun comhairle airgeadais a thabhairt d'iasachtaithe faoin Scéim Chabhrach agus Chomhairle d'iasachtaithe i riaráistí morgáiste.)

source: The Credit Reporting Act 2013 provides for the establishment and operation of a statutory Central Credit Register (CCR) system
ga: Déantar foráil san Acht um Thuairisciú Creidmheasa, 2013 do bhunú agus oibriú córas Clár Lárnach Creidmheasa (CLC) reachtúil

source: Credit providers will be required to report a comprehensive range of credit information
ga: Ceanglófar ar sholáthróirí creidmheasa chun réimse cuimsitheach d’fhaisnéis chreidmheasa a thuairisciú

source: They will be obliged to check with the Register for all applications for credit above €2,000 in value
ga: Ina theannta sin, beidh dualgas orthu seiceáil leis an gClár i dtaobh gach iarratais ar chreidmheas os cionn luach €2,000

source: Consumers will be entitled to get one free copy of their record every 12 months
ga: Beidh tomhaltóirí i dteideal cóip amháin saor in aisce a fháil dá dtaifead gach 12 mhí

source: The initial phase of the Central Credit Register will focus on lending to consumers
ga: Pléifidh céim tosaigh an CLC le hiasachtaí do thomhaltóirí

source: The first enquiries by lenders against the CCR data are expected to start after December 2017
ga: Tá coinne leis go mbeidh iasachtóirí in ann faisnéis a fháil ón CLC tar éis mí na Nollag 2017

source: As well as the major initiatives outlined above, significant changes include:
ga: Mar aon leis na príomhthionscnaimh a dtugtar breac-chuntas orthu thuas, áirítear i measc na n-athruithe móra an méid a leanas:

source: The Social Housing (Assessment) (Amendment) (No.2) Regulations 2011 allow for a borrower whose mortgage has been deemed unsustainable under the MARP to be assessed for social housing
ga: Ceadaíonn na Rialacháin maidir le Measúnú Tithíochta Sóisialta d’iasachtaithe ar measadh go raibh a morgáiste neamh-iniompartha faoin PRRM measúnú a fháil le haghaidh tithíocht shóisialta

source: Arrangements for deferral of Local Property Tax (LPT) are provided for people in mortgage distress and also for people who are in a Debt Settlement Arrangement or a Personal Insolvency Arrangement
ga: Is do dhaoine atá in anacair mhorgáiste agus do dhaoine atá páirteach i Socrú Réitigh Fiachais nó i Socrú um Dhócmhainneacht Phearsanta a chuirtear socruithe ar fáil chun Cáin Mhaoine Áitiúil (CMÁ) a iarchur

source: In 2013 the Central Bank revised (pdf) its system for publishing mortgage arrears data to include buy-to-let arrears and aiming to enable easier tracking than before of the various alternative options on offer to borrowers
ga: Sa bhliain 2013, leasaigh an Banc Ceannais (pdf) an bealach le sonraí ar riaráistí morgáiste a fhoilsiú. Áirítear leis na tuarascálacha riaráistí um cheannach-chun-díol agus tá sé de chuspóir acu rianú níos fusa na roghanna éagsúla eile a éascú atá ar fáil d’iasachtaithe

source: The Department of Finance publishes monthly reports on mortgage arrears and restructures for the 6 main lenders covered by the Central Bank’s Mortgage Arrears Resolution Targets
ga: Eisíonn an Roinn Airgeadais tuarascálacha míosúla ar riaráistí morgáiste agus ar athstruchtúruithe morgáiste do na 6 phríomhiasachtóir atá clúdaithe ag Spriocanna an Bhainc Cheannais um Réiteach Riaráistí Morgáiste

source: These figures relate to mortgages on primary residences only
ga: Baineann na figiúirí sin le morgáistí ar phríomháiteanna cónaithe amháin

source: The Irish Mortgage Holders Organisation (IMHO) has arrangements with 2 banking organisations – AIB Group and KBC Bank – whereby customers can contact IMHO for direct assistance (free of charge) in dealing with these banks about their mortgage arrears
ga: Cuireann tionscnamh speisialta ar chumas chustaiméirí Ghrúpa AIB agus KBC Bank éascaitheoir tríú páirtí a fhostú chun dul i dteagmháil leis an mbanc ar a son

source: These arrangements are funded by the banks but operate independently of them
ga: Is í Eagraíocht Sealbhóirí Morgáiste na hÉireann (IMHO) a sholáthraíonn an tseirbhís, atá á maoiniú ag na bainc, ach oibrítear í go neamhspleách ar na bainc

source: The Central Bank’s framework for restructuring of distressed consumer debt across multiple lenders was implemented during 2013 on a pilot basis and a review of its outcomes (pdf) was published in April 2014
ga: Cuireadh creatlach um athstruchtúrú fiachas anásta tomhaltóra i measc iasachtóirí iolracha an Bhainc Cheannais i bhfeidhm i rith 2013 ar bhonn píolótach agus foilsíodh athbhreithniú ar a torthaí (pdf) in Aibreán 2014

source: The Consumer Protection (Regulation of Credit Servicing Firms) Act 2015 provides that people whose mortgages have been transferred to unregulated entities will have the same protection that they had before the loan was sold
ga: Foráiltear san Acht um Chosaint Tomhaltóirí (Gnólachtaí Seirbhísithe Creidmheasa a Rialáil), 2015 go mbeidh an chosaint chéanna ag daoine ar aistríodh a morgáistí chuig aonáin neamhrialáilte a bhí acu sular díoladh an iasacht

source: The Central Bank's Consumer Protection Code 2012 was updated in 2015 by an addendum (pdf) to make it clear that the Code now applies to credit servicing firms, which are firms that manage loans on behalf of unregulated entities
ga: Cuireadh aguisín (pdf) le Cód um Chosaint Tomhaltóirí 2012 an Bhainc Cheannais i 2015 chun a shoiléiriú go gclúdaíonn an Cód comhlachtaí seirbhísiú creidmheasa - comhlachtaí a riarann iasachtaí ar son aonán neamhrialáilte

source: The following reports provide more information about issues and proposals in this area
ga: Cuireann na tuarascálacha a leanas tuilleadh faisnéise ar fáil ar an gcúlra atá leis na forbairtí ar a dtugtar breac-chuntas thuas

source: The Expert Group on Mortgage Arrears and Personal Debt, which was chaired by Mr Hugh Cooney, published its final report (pdf) in November 2010, building on an interim report (pdf) of July 2010
ga: D’fhoilsigh an Grúpa Saineolaithe maidir le Riaráistí Morgáiste agus Fiachas Pearsanta, ar a raibh an tUasal Hugh Cooney ina chathaoirleach, a dtuarascáil deiridh (pdf) i Samhain 2010, a chuir le tuarascáil eatramhach (pdf) a rinneadh in Iúil 2010

source: The Law Reform Commission's report on Personal Debt Management and Debt Enforcement (pdf) was published in December 2010
ga: Foilsíodh tuarascáil ar Bhainistíocht Fiachais Phearsanta agus Forfheidhmiú Fiachais (pdf) de chuid an Choimisiúin um Athchóiriú an Dlí i Nollaig 2010

source: The Inter-Departmental Mortgage Arrears Working Group, chaired by Mr Declan Keane, reported (pdf) in September 2011
ga: Rinne an Grúpa Oibre Idir-Rannach um Riaráistí Morgáiste, ar a raibh an tUasal Declan Keane ina chathaoirleach tuairisciú (pdf) an 30 Meán Fómhair 2011

source: The Expert Group on Repossessions published its report (pdf) in December 2013
ga: D’fhoilsigh an Sainghrúpa um Athshealbhú a dtuarascáil (pdf) i Nollaig 2013

source: The Joint Oireachtas Committee on Finance, Public Expenditure and Reform held hearings in early 2014 on matters relating to mortgage arrears resolution processes and published its report (pdf) in July 2014
ga: Chuir Comhchoiste um Airgeadas, Caiteachas Poiblí agus Athchóiriú de chuid an Oireachtais éisteachtaí ar bun go luath in 2014 ar cheisteanna a bhain le próisis réitigh riaráistí morgáiste agus d’fhoilsigh siad a dtuarascáil (pdf) in Iúil 2014

source: The Central Bank published its response (pdf) to this report in October 2014
ga: D’fhoilsigh an Banc Ceannais a bhfreagairt (pdf) don tuarascáil seo i nDeireadh Fómhair 2014

source: The Joint Oireachtas Committee on Justice, Defence and Equality published a report in July 2015, recommending that the term for bankruptcy should be reduced from 3 years to 1 year, with extension of up to 3 years in certain circumstances
ga: D’fhoilsigh Comhchoiste Dlí agus Cirt agus Comhionannais an Oireachtais tuarascáil in Iúil 2015, inar moladh gur cheart téarma na féimheachta a laghdú anuas ó 3 bliana go dtí 1 bhliain, agus go dtabharfaí síneadh a fhad le 3 bliana faoi chúinsí áirithe

source: This change took effect on 29 January 2016
ga: Tháinig an t-athrú seo i bhfeidhm ar 29 Eanáir 2016
